# Modifying DataFrame objects
-  to change the names of columns and add and delete columns and rows.

## Renaming columns
- The names of the columns can be changed using the rename method.
- A dictionary is passed as an argument to this method. 
- The keys for this dictionary are the old column names, and the values are the new column names.

In [10]:
import pandas as pd
combined_age=pd.DataFrame({'class 1':[22,40],"class 2":[24,50],"class 3":[20,45]})
combined_age

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

In [150]:
combined_age.rename(columns={"class 1":"batch1","class 2":"batch2","class 3":"batch 3"},inplace=True)

In [151]:
combined_age

   batch1  batch2  batch 3
0      22      24       20
1      40      50       45

In [152]:
combined_age.batch1

0    22
1    40
Name: batch1, dtype: int64

In [153]:
combined_age.batch 3

SyntaxError: invalid syntax (Temp/ipykernel_19176/3694678977.py, line 1)

In [154]:
combined_age.rename(columns={"batch 3":"batch3"},inplace=True)

In [155]:
combined_age

   batch1  batch2  batch3
0      22      24      20
1      40      50      45

In [156]:
combined_age.columns=["class 1","class 2","class 3"]

In [157]:
combined_age

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

In [158]:
combined_age.columns.str

In [159]:
combined_age.columns=combined_age.columns.str.replace(' ','_')

In [160]:
combined_age

   class_1  class_2  class_3
0       22       24       20
1       40       50       45

- Renaming using the dictionary format is a more straightforward method for renaming columns, and the changes are made to the original DataFrame object. 
- The disadvantage with this method is that one needs to remember the order of the columns in the DataFrame. 
- When we used the rename method, we used a dictionary where we knew which column names we were changing.

## Replacing values or observations in a DataFrame
- The replace method can be used to replace values in a DataFrame. 
- We can again use the dictionary format, with the key/value pair representing the old and new values. Here, we replace the value 22 with the value 33.

In [161]:
combined_age

   class_1  class_2  class_3
0       22       24       20
1       40       50       45

In [162]:
combined_age.replace({22:45},inplace=True)
combined_age

   class_1  class_2  class_3
0       45       24       20
1       40       50       45

In [163]:
combined_age.replace({24:55,20:21})

   class_1  class_2  class_3
0       45       55       21
1       40       50       45

## Adding a new column to a DataFrame
There are four ways to insert a new column in a DataFrame

### 1.With the indexing operator, [ ]

In [164]:
combined_age

   class_1  class_2  class_3
0       45       24       20
1       40       50       45

In [165]:
combined_age["class_4"]=[11,22]

In [166]:
combined_age

   class_1  class_2  class_3  class_4
0       45       24       20       11
1       40       50       45       22

### 2.Using the insert method

In [167]:
combined_age.insert(2,'batchY',[10,20],allow_duplicates= True)# if column name is already exist will throw error
combined_age        # addingthe new column in 3 position

   class_1  class_2  batchY  class_3  class_4
0       45       24      10       20       11
1       40       50      20       45       22

In [168]:
del combined_age["batchY"]

In [169]:
combined_age

   class_1  class_2  class_3  class_4
0       45       24       20       11
1       40       50       45       22

### 3.Using the loc indexer

### 4.Using the concat function

In [12]:
batchxy=pd.Series([45,50])
batchxy

0    45
1    50
dtype: int64

In [13]:
combined_age=pd.concat([combined_age,batchxy],axis=1,ignore_index=False)
combined_age

   class 1  class 2  class 3   0
0       22       24       20  45
1       40       50       45  50

In [16]:
combined_age.columns.values

array(['class 1', 'class 2', 'class 3', 0], dtype=object)

In [ ]:
combined_age.columns=["class 1"]

In [19]:
combined_age=combined_age.rename(columns={0:"batchxy"})

In [20]:
combined_age

   class 1  class 2  class 3  batchxy
0       22       24       20       45
1       40       50       45       50

In [21]:
combined_age.empty

False

In [22]:
type(combined_age)

pandas.core.frame.DataFrame

## Inserting rows in a DataFrame
- There are two methods for adding rows in a DataFrame, either by using the append method or with the concat function.

In [172]:
combined_ages=pd.DataFrame({'class 1':[22,40],'class 2':[24,50],'class 3':[20,45]})
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

### 1.Using the append method

In [180]:
### method1
combined_ages=combined_ages.append({'class 1':35,'class 2':33,'class 3':21},ignore_index=True)
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45
2       35       33       21
3       35       33       21

In [178]:
### method2
df=pd.DataFrame(data={"class 1":[23],"class 2":[46],"class 3":[67]})

In [179]:
combined_ages.append(df)

   class 1  class 2  class 3
0       22       24       20
1       40       50       45
2       35       33       21
0       23       46       67

In [182]:
### method3
combined_ages=combined_ages.append([[45,56,78]],ignore_index=False)
combined_ages

   class 1  class 2  class 3     0     1     2
0     22.0     24.0     20.0   NaN   NaN   NaN
1     40.0     50.0     45.0   NaN   NaN   NaN
2     35.0     33.0     21.0   NaN   NaN   NaN
3     35.0     33.0     21.0   NaN   NaN   NaN
4      NaN      NaN      NaN  45.0  56.0  78.0
0      NaN      NaN      NaN  45.0  56.0  78.0

In [183]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'), index=['x', 'y'])
df

   A  B
x  1  2
y  3  4

In [184]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'), index=['x', 'y'])
df2

   A  B
x  5  6
y  7  8

In [185]:
df.append(df2)

   A  B
x  1  2
y  3  4
x  5  6
y  7  8

In [186]:
x=df.append(df2)

In [187]:
x.columns

Index(['A', 'B'], dtype='object')

In [188]:
x.index

Index(['x', 'y', 'x', 'y'], dtype='object')

In [190]:
x.loc['x',"A"]

x    1
x    5
Name: A, dtype: int64

In [191]:
type(x.loc['x',"A"])

pandas.core.series.Series

- the ignore_index=True parameter prevents an error from being thrown.This parameter resets the index. 
- Note that the append method does not have an inplace parameter that would ensure that the changes reflect in the original object

### 2.Using the pd.concat function

In [202]:
combined_ages=pd.DataFrame({'class 1':[22,40],'class 2':[24,50],'class 3':[20,45]})
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

In [203]:
new_row=pd.DataFrame([{'class 1':32,'class 2':37,'class 3':41}])
new_row

   class 1  class 2  class 3
0       32       37       41

In [204]:
df=pd.DataFrame([{'class 1':672,'class 2':437,'class 3':415}])
df

   class 1  class 2  class 3
0      672      437      415

In [205]:
combined_ages=pd.concat([combined_ages,new_row,df],axis=0,ignore_index=True) #axis=0 default
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45
2       32       37       41
3      672      437      415

The pd.concat function is used to add new rows as shown in the preceding syntax. The new row to be added is defined as a DataFrame object. Then the pd.concat function is called and the names of the two DataFrames (the original DataFrame and the new row defined as a DataFrame) are passed as arguments.

## Deleting columns from a DataFrame
- Three methods can be used to delete a column from a DataFrame

In [23]:
combined_ages=pd.DataFrame({'class 1':[22,40],'class 2':[24,50],'class 3':[20,45]})
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

### 1.using del function

The preceding statement deletes the last column (with the name,“class 3”).
Note that the deletion occurs inplace, that is, in the original DataFrame itself.

In [24]:
combined_ages["class 3"]

0    20
1    45
Name: class 3, dtype: int64

In [25]:
del combined_ages["class 3"]

In [26]:
combined_ages

   class 1  class 2
0       22       24
1       40       50

### 2.Using Drop

In [27]:
combined_ages=pd.DataFrame({'class 1':[22,40],'class 2':[24,50],'class 3':[20,45]})
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

In [29]:
combined_ages.drop(["class 1","class 2"],axis=1,inplace=False)

   class 3
0       20
1       45

In [30]:
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

hus, we can use either a Boolean selection or the drop method to remove rows from a DataFrame.Since the drop method works with the removal of both rows and columns, it can be used uniformly.Remember to add the required parameters to the drop method.
For removing columns, the axis (=1) parameter needs to be added. For changes to reflect in the original DataFrame, the inplace (=True) parameter needs to be included.

## Deleting row from a DataFrame

In [31]:
combined_ages=pd.DataFrame({'class 1':[22,40],'class 2':[24,50],'class 3':[20,45]})
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

### 1.using boolean selection

In [34]:
combined_ages[~(combined_ages.values<50)]

   class 1  class 2  class 3
1       40       50       45

In [36]:
combined_ages[~(combined_ages["class 1"]==40)]

   class 1  class 2  class 3
0       22       24       20

### 2.using the drop method

In [37]:
combined_ages=pd.DataFrame({'class 1':[22,40],'class 2':[24,50],'class 3':[20,45]})
combined_ages

   class 1  class 2  class 3
0       22       24       20
1       40       50       45

In [39]:
combined_ages.drop([0],axis=0,inplace=False)

   class 1  class 2  class 3
1       40       50       45

The column(s) that needs to be dropped is mentioned as a string within a list, which is then passed as an argument to the drop method. Since the drop method removes rows (axis=0) by default, we need to specify the axis value as “1” if we want to remove a column. Unlike the del function and pop method, the deletion using the drop method does not occur in the original DataFrame object, and therefore, we need to add the inplace parameter.